{
  "title": "COMPUTING MACHINERY AND INTELLIGENCE",
  "outline": [
    {
      "level": "H1",
      "text": "COMPUTING MACHINERY AND INTELLIGENCE",
      "page": 1
    },
    {
      "level": "H2",
      "text": "In order that tones of voice may not help the interrogator the answers should be written,",
      "page": 1
    },
    {
      "level": "H2",
      "text": "or better still, typewritten. The ideal arrangement is to have a teleprinter communicating",
      "page": 1
    },
    {
      "level": "H2",
      "text": "intermediary. The object of the game for the third player (B) is to help the interrogator.",
      "page": 1
    },
    {
      "level": "H2",
      "text": "\"I am the woman, don't listen to him!\" to her answers, but it will avail nothing as the man",
      "page": 1
    },
    {
      "level": "H2",
      "text": "can make similar remarks.",
      "page": 1
    },
    {
      "level": "H2",
      "text": "the fields of human endeavour that we wish to include. We do not wish to penalise the",
      "page": 2
    },
    {
      "level": "H2",
      "text": "in a race against an aeroplane. The conditions of our game make these disabilities",
      "page": 2
    },
    {
      "level": "H2",
      "text": "about their charms, strength or heroism, but the interrogator cannot demand practical",
      "page": 2
    },
    {
      "level": "H2",
      "text": "demonstrations.",
      "page": 2
    },
    {
      "level": "H3",
      "text": "against the machine. If the man were to try and pretend to be the machine he would",
      "page": 2
    },
    {
      "level": "H2",
      "text": "It may also be said that this identification of machines with digital computers, like our",
      "page": 3
    },
    {
      "level": "H2",
      "text": "that digital computers are unable to give a good showing in the game.",
      "page": 3
    },
    {
      "level": "H2",
      "text": "There are already a number of digital computers in working order, and it may be asked,",
      "page": 3
    },
    {
      "level": "H2",
      "text": "the game. A number of interrogators could be used, and statistics compiled to show how",
      "page": 3
    },
    {
      "level": "H3",
      "text": "whether all digital computers would do well in the game nor whether the computers at",
      "page": 3
    },
    {
      "level": "H2",
      "text": "control is so constructed that this necessarily happens.",
      "page": 4
    },
    {
      "level": "H2",
      "text": "one machine, for instance, a packet might consist of ten decimal digits. Numbers are",
      "page": 4
    },
    {
      "level": "H2",
      "text": "in some systematic manner. A typical instruction might say-",
      "page": 4
    },
    {
      "level": "H2",
      "text": "An interesting variant on the idea of a digital computer is a \"digital computer with a",
      "page": 5
    },
    {
      "level": "H2",
      "text": "equivalent electronic process; one such instruction might for instance be, \"Throw the die",
      "page": 5
    },
    {
      "level": "H2",
      "text": "having free will (though I would not use this phrase myself), It is not normally possible to",
      "page": 5
    },
    {
      "level": "H2",
      "text": "can be produced by such devices as making the choices depend on the digits of the",
      "page": 5
    },
    {
      "level": "H2",
      "text": "decimal for .",
      "page": 5
    },
    {
      "level": "H2",
      "text": "]ever which can be operated from outside; in addition a lamp is to light in one of the",
      "page": 6
    },
    {
      "level": "H2",
      "text": "internal state of the machine (which is described by the position of the wheel) may be q1,",
      "page": 6
    },
    {
      "level": "H2",
      "text": "q2 or q3. There is an input signal i0. or i1 (position of ]ever). The internal state at any",
      "page": 6
    },
    {
      "level": "H2",
      "text": "moment is determined by the last state and input signal according to the table",
      "page": 6
    },
    {
      "level": "H2",
      "text": "Manchester machine has a storage capacity of about 165,000 and the wheel machine of",
      "page": 7
    },
    {
      "level": "H2",
      "text": "obtain the capacity of the resultant machine. This leads to the possibility of statements",
      "page": 7
    },
    {
      "level": "H2",
      "text": "2560, eight electronic tubes with a capacity of 1280. Miscellaneous storage amounts to",
      "page": 7
    },
    {
      "level": "H2",
      "text": "about 300 making a total of 174,380.\"",
      "page": 7
    },
    {
      "level": "H2",
      "text": "Given the table corresponding to a discrete-state machine it is possible to predict what it",
      "page": 7
    },
    {
      "level": "H2",
      "text": "make them play the imitation game so well that an average interrogator will not have",
      "page": 8
    },
    {
      "level": "H2",
      "text": "questioning. The original question, \"Can machines think?\" I believe to be too",
      "page": 8
    },
    {
      "level": "H2",
      "text": "the use of words and general educated opinion will have altered so much that one will be",
      "page": 8
    },
    {
      "level": "H2",
      "text": "that no useful purpose is served by concealing these beliefs. The popular view that",
      "page": 8
    },
    {
      "level": "H3",
      "text": "being influenced by any improved conjecture, is quite mistaken. Provided it is made clear",
      "page": 8
    },
    {
      "level": "H2",
      "text": "adequate refutation of the Copernican theory. With our present knowledge such an",
      "page": 9
    },
    {
      "level": "H2",
      "text": "impression.",
      "page": 9
    },
    {
      "level": "H2",
      "text": "(2) The \"Heads in the Sand\" Objection",
      "page": 9
    },
    {
      "level": "H2",
      "text": "that they cannot do so.\"",
      "page": 9
    },
    {
      "level": "H2",
      "text": "interrogation, it can be shown that the answer is either wrong or not forthcoming. This is",
      "page": 10
    },
    {
      "level": "H2",
      "text": "human intellect is not subject.",
      "page": 10
    },
    {
      "level": "H2",
      "text": "limitations to the Powers If any particular machine, it has only been stated, without any",
      "page": 10
    },
    {
      "level": "H2",
      "text": "view can be dismissed quite so lightly. Whenever one of these machines is asked the",
      "page": 10
    },
    {
      "level": "H2",
      "text": "voce to discover whether some one really understands something or has \"learnt it parrot",
      "page": 11
    },
    {
      "level": "H2",
      "text": "fashion.\" Let us listen in to a part of such a viva voce:",
      "page": 11
    },
    {
      "level": "H2",
      "text": "Interrogator: In the first line of your sonnet which reads \"Shall I compare thee to a",
      "page": 11
    },
    {
      "level": "H2",
      "text": "summer's day,\" would not \"a spring day\" do as well or better?",
      "page": 11
    },
    {
      "level": "H2",
      "text": "Witness: It wouldn't scan.",
      "page": 11
    },
    {
      "level": "H2",
      "text": "Be kind, resourceful, beautiful, friendly, have initiative, have a sense of humour, tell right",
      "page": 12
    },
    {
      "level": "H2",
      "text": "thought, have as much diversity of behaviour as a man, do something really new.",
      "page": 12
    },
    {
      "level": "H2",
      "text": "the principle of scientific induction. A man has seen thousands of machines in his",
      "page": 12
    },
    {
      "level": "H2",
      "text": "ugly, each is designed for a very limited purpose, when required for a minutely different",
      "page": 12
    },
    {
      "level": "H2",
      "text": "conclusion.\" Errors of functioning are due to some mechanical or electrical fault which",
      "page": 13
    },
    {
      "level": "H2",
      "text": "discussions one likes to ignore the possibility of such errors; one is therefore discussing",
      "page": 13
    },
    {
      "level": "H2",
      "text": "physical objects. By definition they are incapable of errors of functioning. In this sense",
      "page": 13
    },
    {
      "level": "H2",
      "text": "arise when some meaning is attached to the output signals from the machine. The",
      "page": 13
    },
    {
      "level": "H3",
      "text": "When a false proposition is typed we say that the machine has committed an error of",
      "page": 13
    },
    {
      "level": "H2",
      "text": "for 'learning.' Whether this is possible in principle or not is a stimulating and exciting",
      "page": 14
    },
    {
      "level": "H2",
      "text": "machines constructed or projected at the time had this property.\"",
      "page": 14
    },
    {
      "level": "H2",
      "text": "I am in thorough agreement with Hartree over this. It will be noticed that he does not",
      "page": 14
    },
    {
      "level": "H2",
      "text": "available to Lady Lovelace did not encourage her to believe that they had it. It is quite",
      "page": 14
    },
    {
      "level": "H3",
      "text": "some discrete-state machine has the property. The Analytical Engine was a universal",
      "page": 14
    },
    {
      "level": "H2",
      "text": "and general principles.",
      "page": 15
    },
    {
      "level": "H2",
      "text": "information about the size of a nervous impulse impinging on a neuron, may make a large",
      "page": 15
    },
    {
      "level": "H2",
      "text": "cannot expect to be able to mimic the behaviour of the nervous system with a discrete-",
      "page": 15
    },
    {
      "level": "H2",
      "text": "state system.",
      "page": 15
    },
    {
      "level": "H2",
      "text": "machine (though not necessarily a discrete-state machine), but that conversely being such",
      "page": 16
    },
    {
      "level": "H2",
      "text": "ourselves of the absence of complete laws of behaviour as of complete rules of conduct.",
      "page": 16
    },
    {
      "level": "H2",
      "text": "certainly know of no circumstances under which we could say, \"We have searched",
      "page": 16
    },
    {
      "level": "H2",
      "text": "enough. There are no such laws.\"",
      "page": 16
    },
    {
      "level": "H2",
      "text": "We can demonstrate more forcibly that any such statement would be unjustified. For",
      "page": 16
    },
    {
      "level": "H2",
      "text": "questioning, by clairvoyance. With ESP anything may happen.",
      "page": 17
    },
    {
      "level": "H2",
      "text": "If telepathy is admitted it will be necessary to tighten our test up. The situation could be",
      "page": 17
    },
    {
      "level": "H2",
      "text": "himself and one of the competitors was listening with his ear to the wall. To put the",
      "page": 17
    },
    {
      "level": "H2",
      "text": "competitors into a \"telepathy-proof room\" would satisfy all requirements.",
      "page": 17
    },
    {
      "level": "H2",
      "text": "7. Learning Machines",
      "page": 17
    },
    {
      "level": "H2",
      "text": "engineering will have to be made too, but it seems unlikely that these will not be",
      "page": 18
    },
    {
      "level": "H2",
      "text": "1010 to 1015 binary digits. I incline to the lower values and believe that only a very small",
      "page": 18
    },
    {
      "level": "H2",
      "text": "fraction is used for the higher types of thinking. Most of it is probably used for the",
      "page": 18
    },
    {
      "level": "H2",
      "text": "retention of visual impressions, I should be surprised if more than 109 was required for",
      "page": 18
    },
    {
      "level": "H2",
      "text": "capacity of the Encyclopaedia Britannica, 11th edition, is 2 X 109) A storage capacity of",
      "page": 18
    },
    {
      "level": "H3",
      "text": "107, would be a very practicable possibility even by present techniques. It is probably not",
      "page": 18
    },
    {
      "level": "H2",
      "text": "Changes of the child machine = mutation,",
      "page": 19
    },
    {
      "level": "H2",
      "text": "Natural selection = judgment of the experimenter",
      "page": 19
    },
    {
      "level": "H2",
      "text": "survival of the fittest is a slow method for measuring advantages. The experimenter, by",
      "page": 19
    },
    {
      "level": "H2",
      "text": "that he is not restricted to random mutations. If he can trace a cause for some weakness",
      "page": 19
    },
    {
      "level": "H2",
      "text": "the logical form of proposition but not belief-value. Certain propositions may be",
      "page": 20
    },
    {
      "level": "H2",
      "text": "imperative is classed as \"well established\" the appropriate action automatically takes",
      "page": 20
    },
    {
      "level": "H2",
      "text": "now.\" This may cause \"Teacher says 'Do your homework now' \" to be included amongst",
      "page": 20
    },
    {
      "level": "H2",
      "text": "true.\" Combining these may eventually lead to the imperative, \"Do your homework now,\"",
      "page": 20
    },
    {
      "level": "H3",
      "text": "machine, will mean that the homework actually gets started, but the effect is very",
      "page": 20
    },
    {
      "level": "H2",
      "text": "this. Most of the programmes which we can put into the machine will result in its doing",
      "page": 21
    },
    {
      "level": "H2",
      "text": "behaviour. Intelligent behaviour presumably consists in a departure from the completely",
      "page": 21
    },
    {
      "level": "H2",
      "text": "give rise to random behaviour, or to pointless repetitive loops. Another important result",
      "page": 21
    },
    {
      "level": "H2",
      "text": "learning is that \"human fallibility\" is likely to be omitted in a rather natural way, i.e.,",
      "page": 21
    },
    {
      "level": "H3",
      "text": "pages 23 and 24.) Processes that are learnt do not produce a hundred per cent certainty of",
      "page": 21
    }
  ]
}